; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport three-cities-sequential-5nodes-1000size-4degree-100mindistance-3trucks-5packages-948seed

(define (problem transport-three-cities-sequential-5nodes-1000size-4degree-100mindistance-3trucks-5packages-948seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-3-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-3-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-3-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-3-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  city-3-loc-5 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 789,31 -> 534,361
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 42)
  ; 534,361 -> 789,31
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 42)
  ; 854,610 -> 534,361
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 41)
  ; 534,361 -> 854,610
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 41)
  ; 854,610 -> 789,31
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 59)
  ; 789,31 -> 854,610
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 59)
  ; 66,89 -> 534,361
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 55)
  ; 534,361 -> 66,89
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 55)
  ; 766,996 -> 854,610
  (road city-1-loc-5 city-1-loc-3)
  (= (road-length city-1-loc-5 city-1-loc-3) 40)
  ; 854,610 -> 766,996
  (road city-1-loc-3 city-1-loc-5)
  (= (road-length city-1-loc-3 city-1-loc-5) 40)
  ; 2650,870 -> 2438,349
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 57)
  ; 2438,349 -> 2650,870
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 57)
  ; 2827,152 -> 2438,349
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 44)
  ; 2438,349 -> 2827,152
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 44)
  ; 2295,727 -> 2438,349
  (road city-2-loc-4 city-2-loc-1)
  (= (road-length city-2-loc-4 city-2-loc-1) 41)
  ; 2438,349 -> 2295,727
  (road city-2-loc-1 city-2-loc-4)
  (= (road-length city-2-loc-1 city-2-loc-4) 41)
  ; 2295,727 -> 2650,870
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 39)
  ; 2650,870 -> 2295,727
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 39)
  ; 2195,926 -> 2650,870
  (road city-2-loc-5 city-2-loc-2)
  (= (road-length city-2-loc-5 city-2-loc-2) 46)
  ; 2650,870 -> 2195,926
  (road city-2-loc-2 city-2-loc-5)
  (= (road-length city-2-loc-2 city-2-loc-5) 46)
  ; 2195,926 -> 2295,727
  (road city-2-loc-5 city-2-loc-4)
  (= (road-length city-2-loc-5 city-2-loc-4) 23)
  ; 2295,727 -> 2195,926
  (road city-2-loc-4 city-2-loc-5)
  (= (road-length city-2-loc-4 city-2-loc-5) 23)
  ; 1718,2030 -> 1273,2079
  (road city-3-loc-3 city-3-loc-1)
  (= (road-length city-3-loc-3 city-3-loc-1) 45)
  ; 1273,2079 -> 1718,2030
  (road city-3-loc-1 city-3-loc-3)
  (= (road-length city-3-loc-1 city-3-loc-3) 45)
  ; 1356,2533 -> 1273,2079
  (road city-3-loc-4 city-3-loc-1)
  (= (road-length city-3-loc-4 city-3-loc-1) 47)
  ; 1273,2079 -> 1356,2533
  (road city-3-loc-1 city-3-loc-4)
  (= (road-length city-3-loc-1 city-3-loc-4) 47)
  ; 1356,2533 -> 1230,2771
  (road city-3-loc-4 city-3-loc-2)
  (= (road-length city-3-loc-4 city-3-loc-2) 27)
  ; 1230,2771 -> 1356,2533
  (road city-3-loc-2 city-3-loc-4)
  (= (road-length city-3-loc-2 city-3-loc-4) 27)
  ; 1279,2349 -> 1273,2079
  (road city-3-loc-5 city-3-loc-1)
  (= (road-length city-3-loc-5 city-3-loc-1) 27)
  ; 1273,2079 -> 1279,2349
  (road city-3-loc-1 city-3-loc-5)
  (= (road-length city-3-loc-1 city-3-loc-5) 27)
  ; 1279,2349 -> 1230,2771
  (road city-3-loc-5 city-3-loc-2)
  (= (road-length city-3-loc-5 city-3-loc-2) 43)
  ; 1230,2771 -> 1279,2349
  (road city-3-loc-2 city-3-loc-5)
  (= (road-length city-3-loc-2 city-3-loc-5) 43)
  ; 1279,2349 -> 1718,2030
  (road city-3-loc-5 city-3-loc-3)
  (= (road-length city-3-loc-5 city-3-loc-3) 55)
  ; 1718,2030 -> 1279,2349
  (road city-3-loc-3 city-3-loc-5)
  (= (road-length city-3-loc-3 city-3-loc-5) 55)
  ; 1279,2349 -> 1356,2533
  (road city-3-loc-5 city-3-loc-4)
  (= (road-length city-3-loc-5 city-3-loc-4) 20)
  ; 1356,2533 -> 1279,2349
  (road city-3-loc-4 city-3-loc-5)
  (= (road-length city-3-loc-4 city-3-loc-5) 20)
  ; 854,610 <-> 2195,926
  (road city-1-loc-3 city-2-loc-5)
  (= (road-length city-1-loc-3 city-2-loc-5) 138)
  (road city-2-loc-5 city-1-loc-3)
  (= (road-length city-2-loc-5 city-1-loc-3) 138)
  (road city-1-loc-5 city-3-loc-4)
  (= (road-length city-1-loc-5 city-3-loc-4) 156)
  (road city-3-loc-4 city-1-loc-5)
  (= (road-length city-3-loc-4 city-1-loc-5) 156)
  (road city-2-loc-5 city-3-loc-5)
  (= (road-length city-2-loc-5 city-3-loc-5) 144)
  (road city-3-loc-5 city-2-loc-5)
  (= (road-length city-3-loc-5 city-2-loc-5) 144)
  (at package-1 city-2-loc-5)
  (at package-2 city-3-loc-3)
  (at package-3 city-3-loc-1)
  (at package-4 city-1-loc-2)
  (at package-5 city-1-loc-1)
  (at truck-1 city-3-loc-4)
  (capacity truck-1 capacity-3)
  (at truck-2 city-1-loc-1)
  (capacity truck-2 capacity-3)
  (at truck-3 city-2-loc-2)
  (capacity truck-3 capacity-3)
 )
 (:goal (and
  (at package-1 city-1-loc-1)
  (at package-2 city-1-loc-3)
  (at package-3 city-3-loc-4)
  (at package-4 city-2-loc-1)
  (at package-5 city-1-loc-5)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-2 city-1-loc-1 city-1-loc-2)
   deleted: (at truck-2 city-1-loc-1)
   added: (at truck-2 city-1-loc-2)
   goals met: 0 of 5
2. (pick-up truck-2 city-1-loc-2 package-4 capacity-2 capacity-3)
   deleted: (at package-4 city-1-loc-2) (capacity truck-2 capacity-3)
   added: (in package-4 truck-2) (capacity truck-2 capacity-2)
   goals met: 0 of 5
3. (drive truck-1 city-3-loc-4 city-3-loc-1)
   deleted: (at truck-1 city-3-loc-4)
   added: (at truck-1 city-3-loc-1)
   goals met: 0 of 5
4. (pick-up truck-1 city-3-loc-1 package-3 capacity-2 capacity-3)
   deleted: (at package-3 city-3-loc-1) (capacity truck-1 capacity-3)
   added: (in package-3 truck-1) (capacity truck-1 capacity-2)
   goals met: 0 of 5
5. (drive truck-1 city-3-loc-1 city-3-loc-3)
   deleted: (at truck-1 city-3-loc-1)
   added: (at truck-1 city-3-loc-3)
   goals met: 0 of 5
6. (pick-up truck-1 city-3-loc-3 package-2 capacity-1 capacity-2)
   deleted: (at package-2 city-3-loc-3) (capacity truck-1 capacity-2)
   added: (in package-2 truck-1) (capacity truck-1 capacity-1)
   goals met: 0 of 5
7. (drive truck-1 city-3-loc-3 city-3-loc-5)
   deleted: (at truck-1 city-3-loc-3)
   added: (at truck-1 city-3-loc-5)
   goals met: 0 of 5
8. (drive truck-1 city-3-loc-5 city-2-loc-5)
   deleted: (at truck-1 city-3-loc-5)
   added: (at truck-1 city-2-loc-5)
   goals met: 0 of 5
9. (pick-up truck-1 city-2-loc-5 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-2-loc-5) (capacity truck-1 capacity-1)
   added: (in package-1 truck-1) (capacity truck-1 capacity-0)
   goals met: 0 of 5
10. (drive truck-1 city-2-loc-5 city-1-loc-3)
   deleted: (at truck-1 city-2-loc-5)
   added: (at truck-1 city-1-loc-3)
   goals met: 0 of 5
11. (drop truck-1 city-1-loc-3 package-2 capacity-0 capacity-1)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-0)
   added: (at package-2 city-1-loc-3) (capacity truck-1 capacity-1)
   goals met: 1 of 5
12. (drive truck-1 city-1-loc-3 city-1-loc-1)
   deleted: (at truck-1 city-1-loc-3)
   added: (at truck-1 city-1-loc-1)
   goals met: 1 of 5
13. (pick-up truck-1 city-1-loc-1 package-5 capacity-0 capacity-1)
   deleted: (at package-5 city-1-loc-1) (capacity truck-1 capacity-1)
   added: (in package-5 truck-1) (capacity truck-1 capacity-0)
   goals met: 1 of 5
14. (drop truck-1 city-1-loc-1 package-1 capacity-0 capacity-1)
   deleted: (in package-1 truck-1) (capacity truck-1 capacity-0)
   added: (at package-1 city-1-loc-1) (capacity truck-1 capacity-1)
   goals met: 2 of 5
15. (drive truck-2 city-1-loc-2 city-1-loc-3)
   deleted: (at truck-2 city-1-loc-2)
   added: (at truck-2 city-1-loc-3)
   goals met: 2 of 5
16. (drive truck-1 city-1-loc-1 city-1-loc-3)
   deleted: (at truck-1 city-1-loc-1)
   added: (at truck-1 city-1-loc-3)
   goals met: 2 of 5
17. (drive truck-1 city-1-loc-3 city-1-loc-5)
   deleted: (at truck-1 city-1-loc-3)
   added: (at truck-1 city-1-loc-5)
   goals met: 2 of 5
18. (drive truck-2 city-1-loc-3 city-2-loc-5)
   deleted: (at truck-2 city-1-loc-3)
   added: (at truck-2 city-2-loc-5)
   goals met: 2 of 5
19. (drive truck-2 city-2-loc-5 city-2-loc-2)
   deleted: (at truck-2 city-2-loc-5)
   added: (at truck-2 city-2-loc-2)
   goals met: 2 of 5
20. (drive truck-2 city-2-loc-2 city-2-loc-1)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-2-loc-1)
   goals met: 2 of 5
21. (drop truck-1 city-1-loc-5 package-5 capacity-1 capacity-2)
   deleted: (in package-5 truck-1) (capacity truck-1 capacity-1)
   added: (at package-5 city-1-loc-5) (capacity truck-1 capacity-2)
   goals met: 3 of 5
22. (drive truck-1 city-1-loc-5 city-3-loc-4)
   deleted: (at truck-1 city-1-loc-5)
   added: (at truck-1 city-3-loc-4)
   goals met: 3 of 5
23. (drop truck-1 city-3-loc-4 package-3 capacity-2 capacity-3)
   deleted: (in package-3 truck-1) (capacity truck-1 capacity-2)
   added: (at package-3 city-3-loc-4) (capacity truck-1 capacity-3)
   goals met: 4 of 5
24. (drop truck-2 city-2-loc-1 package-4 capacity-2 capacity-3)
   deleted: (in package-4 truck-2) (capacity truck-2 capacity-2)
   added: (at package-4 city-2-loc-1) (capacity truck-2 capacity-3)
   goals met: 5 of 5
